# ExportRoomGeometry Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ExportRoomGeometry Property
NavisworksExportOptions Class See Also
---
True to export Revit room geometry, false otherwise. Default value is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ExportRoomGeometry { get; set; }
```

Visual Basic
---
```text
Public Property ExportRoomGeometry As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ExportRoomGeometry {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace